tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# Record and share terminal sessions
brew "asciinema"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# CLI tool for quick access to files and directories
brew "fasd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Open source relational database management system
brew "mysql", restart_service: true
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# App to build and share containerized applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Tools to protect your emails and files
cask "gpg-suite"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Finder Toolbar app to open the current directory in Terminal
cask "openinterminal-lite"
cask "tunnelblick"
# Open-source code editor
cask "visual-studio-code"
